In [ ]:
%pip install jupysql duckdb-engine

In [3]:
%reload_ext sql

In [4]:
%sql duckdb:///hr.data.db

Connecting to 'duckdb:///hr.data.db'

In [6]:
%%sql

CREATE TABLE EMPLOYEES (
                            EMP_ID CHAR(9) NOT NULL, 
                            F_NAME VARCHAR(15) NOT NULL,
                            L_NAME VARCHAR(15) NOT NULL,
                            SSN CHAR(9),
                            B_DATE DATE,
                            SEX CHAR,
                            ADDRESS VARCHAR(30),
                            JOB_ID CHAR(9),
                            SALARY DECIMAL(10,2),
                            MANAGER_ID CHAR(9),
                            DEP_ID CHAR(9) NOT NULL,
                            PRIMARY KEY (EMP_ID));
                            
  CREATE TABLE JOB_HISTORY (
                            EMPL_ID CHAR(9) NOT NULL, 
                            START_DATE DATE,
                            JOBS_ID CHAR(9) NOT NULL,
                            DEPT_ID CHAR(9),
                            PRIMARY KEY (EMPL_ID,JOBS_ID));
 
 CREATE TABLE JOBS (
                            JOB_IDENT CHAR(9) NOT NULL, 
                            JOB_TITLE VARCHAR(30),
                            MIN_SALARY DECIMAL(10,2),
                            MAX_SALARY DECIMAL(10,2),
                            PRIMARY KEY (JOB_IDENT));

CREATE TABLE DEPARTMENTS (
                            DEPT_ID_DEP CHAR(9) NOT NULL, 
                            DEP_NAME VARCHAR(15) ,
                            MANAGER_ID CHAR(9),
                            LOC_ID CHAR(9),
                            PRIMARY KEY (DEPT_ID_DEP));

CREATE TABLE LOCATIONS (
                            LOCT_ID CHAR(9) NOT NULL,
                            DEP_ID_LOC CHAR(9) NOT NULL,
                            PRIMARY KEY (LOCT_ID,DEP_ID_LOC));

Running query in 'duckdb:///hr.data.db'

+-------+
| Count |
+-------+
+-------+

In [10]:
%%sql INSERT INTO LOCATIONS SELECT * FROM read_csv('https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%202/data/Locations.csv');
FROM LOCATIONS

Running query in 'duckdb:///hr.data.db'

+---------+------------+
| LOCT_ID | DEP_ID_LOC |
+---------+------------+
|  L0001  |     2      |
|  L0002  |     5      |
|  L0003  |     7      |
+---------+------------+

In [12]:
%sql INSERT INTO DEPARTMENTS SELECT * FROM read_csv('https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/datasets/HR_Database/Departments.csv')

Running query in 'duckdb:///hr.data.db'

+-------+
| Count |
+-------+
+-------+

In [19]:
%sql INSERT INTO EMPLOYEES SELECT * FROM read_csv('https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%202/data/Employees.csv')

Running query in 'duckdb:///hr.data.db'

+-------+
| Count |
+-------+
+-------+

In [24]:
%sql INSERT INTO JOBS SELECT * FROM read_csv('https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%202/data/Jobs.csv')

Running query in 'duckdb:///hr.data.db'

+-------+
| Count |
+-------+
+-------+

In [26]:
%sql INSERT INTO JOB_HISTORY SELECT * FROM read_csv('https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%202/data/JobsHistory.csv')

Running query in 'duckdb:///hr.data.db'

+-------+
| Count |
+-------+
+-------+

In [30]:
%%sql

# Include the following columns: first name, last name from the employees table and start date from the job history table
# From the employees table, defined as E
# Include the job history table defined as JH as an inner join which returns only the rows with matching values in both tables
# Join over the the employee ID
# List records where the department ID is 5

SELECT E.F_NAME,E.L_NAME, JH.START_DATE
FROM EMPLOYEES as E
INNER JOIN JOB_HISTORY as JH 
ON E.EMP_ID=JH.EMPL_ID
WHERE E.DEP_ID ='5';

Running query in 'duckdb:///hr.data.db'

+---------+--------+------------+
|  F_NAME | L_NAME | START_DATE |
+---------+--------+------------+
|  Alice  | James  | 2001-08-01 |
|  Steve  | Wells  | 2001-08-16 |
| Santosh | Kumar  | 2000-08-16 |
|   Ann   | Jacob  | 2016-08-16 |
+---------+--------+------------+

In [29]:
%%sql

# Include the following columns: employee ID, last name, department ID from Employees table and department name from departments table
# From the employees table, defined as E
# Include departments table defined as D as an left outer join which returns all the rows from left table and matching rows from right table
# Join over the the department ID

SELECT E.EMP_ID, E.L_NAME, E.DEP_ID, D.DEP_NAME
FROM EMPLOYEES AS E 
LEFT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID=D.DEPT_ID_DEP;

Running query in 'duckdb:///hr.data.db'

+--------+---------+--------+-----------------+
| EMP_ID |  L_NAME | DEP_ID |     DEP_NAME    |
+--------+---------+--------+-----------------+
| E1001  |  Thomas |   2    | Architect Group |
| E1002  |  James  |   5    |  Software Group |
| E1003  |  Wells  |   5    |  Software Group |
| E1004  |  Kumar  |   5    |  Software Group |
| E1005  | Hussain |   2    | Architect Group |
| E1006  |  Allen  |   2    | Architect Group |
| E1007  |  Thomas |   7    |   Design Team   |
| E1008  |  Gupta  |   7    |   Design Team   |
| E1009  |  Jones  |   7    |   Design Team   |
| E1010  |  Jacob  |   5    |  Software Group |
+--------+---------+--------+-----------------+
Truncated to displaylimit of 10.

In [33]:
%%sql

# Include the following columns: first name and last name from the Employees table and department name from the departments table
# From the employees table, defined as E
# Include departments table defined as D as an left outer join which returns all the rows from the left table and matching rows from the right table
# Join over the the department ID
# Join left and right outer joins
# Include the following columns: first name and last name from the Employees table and department name from the departments table
# From the employees table, defined as E
# Include departments table defined as D as an right outer join which returns all the rows from the right table and matching rows from the left table
# Join over the the department ID

SELECT E.F_NAME, E.L_NAME, D.DEP_NAME
FROM EMPLOYEES AS E
LEFT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID = D.DEPT_ID_DEP

UNION

SELECT E.F_NAME, E.L_NAME, D.DEP_NAME
FROM EMPLOYEES AS E
RIGHT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID=D.DEPT_ID_DEP

Running query in 'duckdb:///hr.data.db'

+---------+---------+-----------------+
|  F_NAME |  L_NAME |     DEP_NAME    |
+---------+---------+-----------------+
|  Steve  |  Wells  |  Software Group |
| Santosh |  Kumar  |  Software Group |
|  Nancy  |  Allen  | Architect Group |
| Bharath |  Gupta  |   Design Team   |
|   Ann   |  Jacob  |  Software Group |
|  Alice  |  James  |  Software Group |
|   John  |  Thomas | Architect Group |
|  Ahmed  | Hussain | Architect Group |
|   Mary  |  Thomas |   Design Team   |
|  Andrea |  Jones  |   Design Team   |
+---------+---------+-----------------+
Truncated to displaylimit of 10.

In [39]:
%%sql

# Retrieve the names, job start dates, and job titles of all employees who work for department number 5
# Include the following columns: first, last name from employee, start date from job history and job title from jobs
# From the employees table (E)
# Include job history table (JH) as an inner join over the employee ID
# Include jobs table (J) as an inner join over the job ID
# Retrieve records where department number is 5

SELECT E.F_NAME, E.L_NAME, JH.START_DATE, J.JOB_TITLE
FROM EMPLOYEES as E
INNER JOIN JOB_HISTORY as JH ON E.EMP_ID=JH.EMPL_ID
INNER JOIN JOBS as J ON E.JOB_ID=J.JOB_IDENT
WHERE E.DEP_ID ='5';

Running query in 'duckdb:///hr.data.db'

+---------+--------+------------+------------------------+
|  F_NAME | L_NAME | START_DATE |       JOB_TITLE        |
+---------+--------+------------+------------------------+
|  Alice  | James  | 2001-08-01 | Sr. Software Developer |
|  Steve  | Wells  | 2001-08-16 | Jr.Software Developer  |
| Santosh | Kumar  | 2000-08-16 | Jr.Software Developer  |
|   Ann   | Jacob  | 2016-08-16 |      Sr. Designer      |
+---------+--------+------------+------------------------+

In [53]:
%%sql

# Retrieve employee ID, last name, and department ID for all employees but department names for only those born before 1980
# Include the following columns: employee ID, last name, department ID, department name
# From the employees table (E) and from the departments table (D) as an left outer join over the department ID
# When the year of the employee's birth date is before 1980

SELECT E.EMP_ID, E.L_NAME, D.DEPT_ID_DEP, D.DEP_NAME
FROM EMPLOYEES AS E 
LEFT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID=D.DEPT_ID_DEP
AND YEAR(E.B_DATE) < 1980;

Running query in 'duckdb:///hr.data.db'

+--------+---------+-------------+-----------------+
| EMP_ID |  L_NAME | DEPT_ID_DEP |     DEP_NAME    |
+--------+---------+-------------+-----------------+
| E1001  |  Thomas |      2      | Architect Group |
| E1006  |  Allen  |      2      | Architect Group |
| E1002  |  James  |      5      |  Software Group |
| E1007  |  Thomas |      7      |   Design Team   |
| E1003  |  Wells  |     None    |       None      |
| E1004  |  Kumar  |     None    |       None      |
| E1005  | Hussain |     None    |       None      |
| E1008  |  Gupta  |     None    |       None      |
| E1009  |  Jones  |     None    |       None      |
| E1010  |  Jacob  |     None    |       None      |
+--------+---------+-------------+-----------------+
Truncated to displaylimit of 10.

In [56]:
%%sql

# Retrieve the first name and last name of all employees but department ID and department names only for male employees
# Include the following columns: first name, last name, department ID, department name
# From the employees table (E) and from the departments table (D) as an left outer join over the department ID
# When the sex of the employee is male

SELECT E.F_NAME, E.L_NAME, D.DEPT_ID_DEP, D.DEP_NAME
FROM EMPLOYEES AS E 
LEFT OUTER JOIN DEPARTMENTS AS D
ON E.DEP_ID=D.DEPT_ID_DEP
AND E.SEX = 'M';

Running query in 'duckdb:///hr.data.db'

+---------+---------+-------------+-----------------+
|  F_NAME |  L_NAME | DEPT_ID_DEP |     DEP_NAME    |
+---------+---------+-------------+-----------------+
|   John  |  Thomas |      2      | Architect Group |
|  Ahmed  | Hussain |      2      | Architect Group |
|  Steve  |  Wells  |      5      |  Software Group |
| Santosh |  Kumar  |      5      |  Software Group |
| Bharath |  Gupta  |      7      |   Design Team   |
|  Alice  |  James  |     None    |       None      |
|  Nancy  |  Allen  |     None    |       None      |
|   Mary  |  Thomas |     None    |       None      |
|  Andrea |  Jones  |     None    |       None      |
|   Ann   |  Jacob  |     None    |       None      |
+---------+---------+-------------+-----------------+
Truncated to displaylimit of 10.